experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/nano-vllm__ragged-native.log
INFO 08-18 18:03:44 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 18:03:44 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 18:03:46 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 18:03:47 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x74bab6e00860>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0.75', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://nano-vllm:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='nano-vllm__ragged-native.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-0913c06f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 18:03:49 [utils.py:90] Sampling input_len from [128, 896] and output_len from [128, 896]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  726.13    
Total input tokens:                      51917     
Total generated tokens:                  47224     
Request throughput (req/s):              0.14      
Output token throughput (tok/s):         65.04     
Peak output token throughput (tok/s):    73.00     
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          136.53    
---------------Time to First Token----------------
Mean TTFT (ms):                          325788.02 
Median TTFT (ms):                        330405.66 
P99 TTFT (ms):                           683489.13 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          120.75    
Median TPOT (ms):                        121.39    
P99 TPOT (ms):                           125.13    
---------------Inter-token Latency----------------
Mean ITL (ms):                           125.35    
Median ITL (ms):                         120.49    
P99 ITL (ms):                            243.63    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          382509.47 
Median E2EL (ms):                        386179.78 
P99 E2EL (ms):                           716075.10 
==================================================

--- stderr ---
W0818 18:03:45.534000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:11<18:15, 11.07s/it]
  2%|▏         | 2/100 [00:37<33:00, 20.21s/it]
  3%|▎         | 3/100 [00:39<19:27, 12.04s/it]
  4%|▍         | 4/100 [00:40<11:51,  7.41s/it]
  5%|▌         | 5/100 [00:44<10:06,  6.38s/it]
  6%|▌         | 6/100 [00:49<08:50,  5.64s/it]
  7%|▋         | 7/100 [01:07<15:12,  9.81s/it]
  8%|▊         | 8/100 [01:08<10:47,  7.04s/it]
  9%|▉         | 9/100 [01:22<14:05,  9.30s/it]
 10%|█         | 10/100 [01:29<12:33,  8.37s/it]
 11%|█         | 11/100 [01:37<12:13,  8.24s/it]
 12%|█▏        | 12/100 [01:42<10:43,  7.32s/it]
 13%|█▎        | 13/100 [01:43<07:49,  5.40s/it]
 14%|█▍        | 14/100 [01:44<06:03,  4.23s/it]
 15%|█▌        | 15/100 [02:07<13:43,  9.69s/it]
 16%|█▌        | 16/100 [02:09<10:40,  7.62s/it]
 17%|█▋        | 17/100 [02:13<08:48,  6.37s/it]
 18%|█▊        | 18/100 [02:19<08:24,  6.15s/it]
 19%|█▉        | 19/100 [02:22<07:11,  5.33s/it]
 20%|██        | 20/100 [02:29<07:44,  5.81s/it]
 21%|██        | 21/100 [02:51<14:15, 10.82s/it]
 22%|██▏       | 22/100 [02:53<10:20,  7.95s/it]
 23%|██▎       | 23/100 [02:58<09:05,  7.09s/it]
 24%|██▍       | 24/100 [03:16<13:18, 10.51s/it]
 25%|██▌       | 25/100 [03:25<12:29,  9.99s/it]
 26%|██▌       | 26/100 [03:25<08:48,  7.14s/it]
 27%|██▋       | 27/100 [03:26<06:07,  5.04s/it]
 28%|██▊       | 28/100 [03:43<10:28,  8.73s/it]
 29%|██▉       | 29/100 [03:58<12:30, 10.58s/it]
 30%|███       | 30/100 [03:58<08:51,  7.59s/it]
 31%|███       | 31/100 [03:59<06:14,  5.43s/it]
 32%|███▏      | 32/100 [04:09<07:45,  6.84s/it]
 33%|███▎      | 33/100 [04:24<10:21,  9.27s/it]
 34%|███▍      | 34/100 [04:36<11:00, 10.00s/it]
 35%|███▌      | 35/100 [04:47<11:16, 10.41s/it]
 36%|███▌      | 36/100 [04:52<09:24,  8.82s/it]
 37%|███▋      | 37/100 [05:01<09:11,  8.75s/it]
 38%|███▊      | 38/100 [05:04<07:12,  6.97s/it]
 39%|███▉      | 39/100 [05:07<06:02,  5.94s/it]
 40%|████      | 40/100 [05:12<05:34,  5.57s/it]
 41%|████      | 41/100 [05:13<04:11,  4.27s/it]
 42%|████▏     | 42/100 [05:30<07:42,  7.97s/it]
 43%|████▎     | 43/100 [05:30<05:23,  5.67s/it]
 44%|████▍     | 44/100 [05:35<05:04,  5.43s/it]
 45%|████▌     | 45/100 [06:06<12:04, 13.17s/it]
 46%|████▌     | 46/100 [06:06<08:20,  9.27s/it]
 47%|████▋     | 47/100 [06:07<06:00,  6.80s/it]
 48%|████▊     | 48/100 [06:23<08:10,  9.42s/it]
 49%|████▉     | 49/100 [06:23<05:41,  6.69s/it]
 50%|█████     | 50/100 [06:25<04:25,  5.30s/it]
 51%|█████     | 51/100 [06:26<03:18,  4.04s/it]
 52%|█████▏    | 52/100 [06:27<02:30,  3.13s/it]
 53%|█████▎    | 53/100 [06:37<04:03,  5.18s/it]
 54%|█████▍    | 54/100 [06:41<03:40,  4.80s/it]
 55%|█████▌    | 55/100 [06:57<06:06,  8.15s/it]
 56%|█████▌    | 56/100 [07:23<09:49, 13.41s/it]
 57%|█████▋    | 57/100 [07:25<07:11, 10.03s/it]
 58%|█████▊    | 58/100 [07:25<05:00,  7.15s/it]
 59%|█████▉    | 59/100 [07:30<04:28,  6.54s/it]
 60%|██████    | 60/100 [07:35<04:03,  6.09s/it]
 61%|██████    | 61/100 [07:39<03:30,  5.39s/it]
 62%|██████▏   | 62/100 [07:46<03:38,  5.75s/it]
 63%|██████▎   | 63/100 [07:51<03:25,  5.57s/it]
 64%|██████▍   | 64/100 [07:54<02:54,  4.85s/it]
 65%|██████▌   | 65/100 [07:57<02:25,  4.16s/it]
 66%|██████▌   | 66/100 [08:04<02:50,  5.00s/it]
 67%|██████▋   | 67/100 [08:12<03:19,  6.03s/it]
 68%|██████▊   | 68/100 [08:19<03:20,  6.26s/it]
 69%|██████▉   | 69/100 [08:31<04:03,  7.87s/it]
 70%|███████   | 70/100 [08:45<04:51,  9.73s/it]
 71%|███████   | 71/100 [08:50<04:01,  8.34s/it]
 72%|███████▏  | 72/100 [09:01<04:22,  9.37s/it]
 73%|███████▎  | 73/100 [09:08<03:52,  8.61s/it]
 74%|███████▍  | 74/100 [09:16<03:40,  8.47s/it]
 75%|███████▌  | 75/100 [09:18<02:39,  6.37s/it]
 76%|███████▌  | 76/100 [09:22<02:15,  5.64s/it]
 77%|███████▋  | 77/100 [09:27<02:04,  5.40s/it]
 78%|███████▊  | 78/100 [09:30<01:46,  4.85s/it]
 79%|███████▉  | 79/100 [09:32<01:21,  3.88s/it]
 80%|████████  | 80/100 [09:43<01:59,  5.99s/it]
 81%|████████  | 81/100 [09:43<01:23,  4.39s/it]
 82%|████████▏ | 82/100 [09:56<02:04,  6.92s/it]
 83%|████████▎ | 83/100 [10:05<02:08,  7.57s/it]
 84%|████████▍ | 84/100 [10:26<03:05, 11.57s/it]
 85%|████████▌ | 85/100 [10:34<02:37, 10.51s/it]
 86%|████████▌ | 86/100 [10:38<02:00,  8.58s/it]
 87%|████████▋ | 87/100 [10:48<01:56,  8.95s/it]
 88%|████████▊ | 88/100 [10:53<01:31,  7.65s/it]
 89%|████████▉ | 89/100 [10:54<01:04,  5.85s/it]
 90%|█████████ | 90/100 [11:05<01:11,  7.16s/it]
 91%|█████████ | 91/100 [11:23<01:34, 10.46s/it]
 92%|█████████▏| 92/100 [11:26<01:06,  8.27s/it]
 93%|█████████▎| 93/100 [11:38<01:05,  9.33s/it]
 94%|█████████▍| 94/100 [11:42<00:47,  7.92s/it]
 95%|█████████▌| 95/100 [11:49<00:37,  7.51s/it]
 96%|█████████▌| 96/100 [11:50<00:22,  5.59s/it]
 97%|█████████▋| 97/100 [11:51<00:12,  4.30s/it]
 98%|█████████▊| 98/100 [11:55<00:08,  4.00s/it]
 99%|█████████▉| 99/100 [11:55<00:03,  3.04s/it]
100%|██████████| 100/100 [12:06<00:00,  5.17s/it]
100%|██████████| 100/100 [12:06<00:00,  7.26s/it]